Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.monitoring.aws_cloudwatch_log_metric_filter.lambda_mail_fail: Refreshing state... [id=lambda-mail-fail]
module.monitoring.aws_iam_policy.grafana_cloudwatch: Refreshing state... [id=arn:aws:iam::635140758252:policy/grafana-cloudwatch-policy]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.monitoring.aws_sns_topic.monitoring_alerts: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:38]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0c139126ab6f52636]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250619010241746800000002]
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250619010241756400000003]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250619010241785600000004]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250619010241786600000005]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250619010241744300000001]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250619010241791300000006]
module.monitoring.aws_sns_topic_subscription.email["skdurtlxx@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:d73a68a6-0698-4fb0-96f3-337239fae44e]
module.monitoring.aws_sns_topic_subscription.email["sunyj1225@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:511c9e7e-9db0-4211-9673-91e18aa32200]
module.monitoring.aws_sns_topic_subscription.email["jintonylove@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:4d424624-6ec3-41e6-8ae7-aa8e3d0234b7]
module.monitoring.aws_sns_topic_subscription.email["oosuoos@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:6945f494-f337-402c-aea9-2f81c39d2d75]
module.monitoring.aws_sns_topic_subscription.email["95eksldpf@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:20fc3360-0327-41b4-87b1-650dcf81cfbb]
module.monitoring.aws_cloudwatch_metric_alarm.mail_fail_alarm: Refreshing state... [id=MailSendFailAlarm]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-031431cd7cb2db44b]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-0b9440eaed3d94f1d]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-0a100c84070398b39]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-06b509e37e71b8382]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-04b04ffc940e5102e]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-0639fdfe2b40eda52]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0a1e02672d57dba68]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0e3108a1e9f603472]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.rds.aws_db_parameter_group.timezone: Refreshing state... [id=news-rds-timezone]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-05feda0fd0e32480f]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::635140758252:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/0DCE3E2F0EEF6ACB802A5B2B8A227D06]
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
module.route.aws_route_table.public: Refreshing state... [id=rtb-0a8e68f1887324df2]
module.route.aws_route_table.private: Refreshing state... [id=rtb-06cfa389f0f1c597d]
module.monitoring.aws_iam_role.grafana_irsa: Refreshing state... [id=eks-irsa-grafana]
module.monitoring.aws_iam_role_policy_attachment.grafana_attach: Refreshing state... [id=eks-irsa-grafana-2025061901100185480000000b]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-09e5eb99cd82c8b5e]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-04e39377b79015eba]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-06cfa389f0f1c597d1080289494]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0bc7be5f38412a0e6]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-0a8e68f1887324df21080289494]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-04c8f681da1a2b95f]
helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.rds.aws_db_instance.this: Refreshing state... [id=db-JSH7KZ3JTPIKY5O4FFUOLAREFM]
module.monitoring.aws_cloudwatch_dashboard.main: Refreshing state... [id=main-monitoring]
module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=RDS-CPU-High]
module.docker_images.aws_lambda_function.news-crawler_mw: Refreshing state... [id=news-crawler-lambda]
module.sending_news.data.archive_file.lambda_zip: Reading...
module.sql_initializer.data.archive_file.lambda_zip: Reading...
module.sending_news.data.archive_file.lambda_zip: Read complete after 0s [id=06efbeea5b5db0c168e4673cd036e00d561405ac]
module.sql_initializer.data.archive_file.lambda_zip: Read complete after 0s [id=0899ea48a4890ef92bf65a5819e2484b1ea18d7b]
module.sending_news.aws_lambda_function.this: Refreshing state... [id=news-lambda-handler]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["sending_news"]: Refreshing state... [id=sending_news]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["crawler"]: Refreshing state... [id=crawler]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["sending_news"]: Refreshing state... [id=AllowExecutionFromEventBridge-sending_news]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["crawler"]: Refreshing state... [id=AllowExecutionFromEventBridge-crawler]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["crawler"]: Refreshing state... [id=crawler-crawler]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["sending_news"]: Refreshing state... [id=sending_news-sending-news]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.monitoring.helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana-monitoring"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "adminPassword"
              + value = "SuperSecret123"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "service.type"
              + value = "ClusterIP"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.name"
              + value = "grafana"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.create"
              + value = "false"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # CloudWatch Datasource 정의 추가
                datasources:
                  datasources.yaml:
                    apiVersion: 1
                    datasources:
                      - name: CloudWatch
                        uid: CloudWatch
                        type: cloudwatch
                        access: proxy
                        isDefault: true
                        jsonData:
                          authType: ec2_iam_role
                          defaultRegion: ap-northeast-2
                
                # 대시보드 자동 로드 및 패널 정의
                dashboardProviders:
                  dashboardproviders.yaml:
                    apiVersion: 1
                    providers:
                      - name: "default"
                        orgId: 1
                        folder: ""
                        type: file
                        disableDeletion: false
                        updateIntervalSeconds: 10
                        options:
                          path: /var/lib/grafana/dashboards/default
                
                dashboards:
                  default:
                    news-subscribe-dashboard:
                      json: |
                        {
                          "title": "NewsSubscribe Monitoring Dashboard",
                          "time": { "from": "now-6h", "to": "now" },
                          "panels": [
                            {
                              "type": "timeSeries",
                              "title": "RDS Replica Lag (s)",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "metricName": "ReplicaLag",
                                  "namespace": "AWS/RDS",
                                  "dimensions": { "DBInstanceIdentifier": "news-rds" },
                                  "region": "ap-northeast-2",
                                  "stat": "Maximum",
                                  "period": 60,
                                  "refId": "RDS_ReplicaLag"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "Lambda Errors - sending_news",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "metricName": "Errors",
                                  "namespace": "AWS/Lambda",
                                  "dimensions": { "FunctionName": "news-lambda-handler" },
                                  "region": "ap-northeast-2",
                                  "stat": "Sum",
                                  "period": 60,
                                  "refId": "LambdaErr_sending"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "메일 전송 성공",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-lambda-handler} \"메일 전송 성공\"', 'Count', 60)",
                                  "region": "ap-northeast-2",
                                  "refId": "MailOK_sending"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "메일 전송 실패",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-lambda-handler} \"메일 전송 실패\"', 'Count', 60)",
                                  "region": "ap-northeast-2",
                                  "refId": "MailErr_sending"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "Lambda Errors - crawler",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "metricName": "Errors",
                                  "namespace": "AWS/Lambda",
                                  "dimensions": { "FunctionName": "news-crawler-lambda" },
                                  "region": "ap-northeast-2",
                                  "stat": "Sum",
                                  "period": 60,
                                  "refId": "LambdaErr_crawler"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "크롤링 성공",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-crawler-lambda} \"크롤링 성공\"', 'Count', 60)",
                                  "region": "ap-northeast-2",
                                  "refId": "CrawlOK"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "크롤링 삭제",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-crawler-lambda} \"크롤링 삭제\"', 'Count', 60)",
                                  "region": "ap-northeast-2",
                                  "refId": "CrawlDel"
                                }
                              ]
                            }
                          ]
                        }
            EOT,
        ]
      + verify                     = false
      + version                    = "7.3.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.monitoring.kubernetes_service_account.grafana will be created
  + resource "kubernetes_service_account" "grafana" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn" = "arn:aws:iam::635140758252:role/eks-irsa-grafana"
            }
          + generation       = (known after apply)
          + name             = "grafana"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->